In [2]:
from pymongo import MongoClient
import pandas as pd

In [3]:
client = MongoClient( 
    host = 'localhost', 
    port = 27017
)

In [4]:
client.list_database_names()

['admin', 'config', 'local', 'test', 'ubion']

In [5]:
db = client["ubion"]
db.test.find()

In [6]:
db = client["ubion"]
list(db["test"].find())

[{'_id': ObjectId('623297f596cd94d777d8d024'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('62329a5096cd94d777d8d025'), '1': '2'},
 {'_id': ObjectId('62329a5096cd94d777d8d026'), '3': '4'},
 {'_id': ObjectId('6232b60a96cd94d777d8d028'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('6232b60a96cd94d777d8d029'), '1': '2'},
 {'_id': ObjectId('6232b60a96cd94d777d8d02a'), '3': '4'},
 {'_id': ObjectId('6233d75e67d17ecd08f21c1e'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('6233d75e67d17ecd08f21c1f'), '1': '2'},
 {'_id': ObjectId('6233d75e67d17ecd08f21c20'), '3': '4'}]

In [7]:
data = { 
    "1" : "1", 
    "2":"2", 
    "3":"3"}

db.test.insert_one(data)
#INSERT INTO test VALUE()

In [8]:
### data 변수 만들어서 insert_many를 사용해볼것!
data = [{ 
    "1":"2"}, 
    {"3":"4"
}]
db.test.insert_many(data)

In [9]:
list(db.test.find())

[{'_id': ObjectId('623297f596cd94d777d8d024'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('62329a5096cd94d777d8d025'), '1': '2'},
 {'_id': ObjectId('62329a5096cd94d777d8d026'), '3': '4'},
 {'_id': ObjectId('6232b60a96cd94d777d8d028'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('6232b60a96cd94d777d8d029'), '1': '2'},
 {'_id': ObjectId('6232b60a96cd94d777d8d02a'), '3': '4'},
 {'_id': ObjectId('6233d75e67d17ecd08f21c1e'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('6233d75e67d17ecd08f21c1f'), '1': '2'},
 {'_id': ObjectId('6233d75e67d17ecd08f21c20'), '3': '4'},
 {'_id': ObjectId('623409e73408280851ab9cc3'), '1': '1', '2': '2', '3': '3'},
 {'_id': ObjectId('623409e93408280851ab9cc4'), '1': '2'},
 {'_id': ObjectId('623409e93408280851ab9cc5'), '3': '4'}]

In [13]:
db

Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'ubion')

In [14]:
db.list_collection_names

In [15]:
db

Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'ubion')

In [16]:
db.test2.insert_many( 
    [ 
        {'number' : i} for i in range(10)
    ]
)

In [17]:
list(db.test2.find())

[{'_id': ObjectId('62340a4a3408280851ab9cc6'), 'number': 0},
 {'_id': ObjectId('62340a4a3408280851ab9cc7'), 'number': 1},
 {'_id': ObjectId('62340a4a3408280851ab9cc8'), 'number': 2},
 {'_id': ObjectId('62340a4a3408280851ab9cc9'), 'number': 3},
 {'_id': ObjectId('62340a4a3408280851ab9cca'), 'number': 4},
 {'_id': ObjectId('62340a4a3408280851ab9ccb'), 'number': 5},
 {'_id': ObjectId('62340a4a3408280851ab9ccc'), 'number': 6},
 {'_id': ObjectId('62340a4a3408280851ab9ccd'), 'number': 7},
 {'_id': ObjectId('62340a4a3408280851ab9cce'), 'number': 8},
 {'_id': ObjectId('62340a4a3408280851ab9ccf'), 'number': 9}]

In [18]:
import mod_sql
import pandas as pd
import pprint

In [19]:
_db = mod_sql.Database()

In [20]:
sql = """ 
        SELECT * FROM emp 
        """
result = _db.executeAll(sql)
pd.DataFrame(result).to_csv('emp.csv')

ProgrammingError: (1146, "Table 'ubion.emp' doesn't exist")

In [22]:
db.emp.insert_many(dict(pd.dataframe(result)))

AttributeError: module 'pandas' has no attribute 'dataframe'

In [ ]:
db.emp.find_one()

{'_id': ObjectId('6232b72aac16255c494f1e42'),
 '': '0',
 'EMPNO': '7369',
 'ENAME': 'SMITH',
 'JOB': 'CLERK',
 'MGR': '7902',
 'HIREDATE': '1980-12-17',
 'SAL': '800.00',
 'DEPTNO': '20'}

In [ ]:
list(db.emp.find( 
    { 
        "ENAME":"SMITH"
    }
))
# 이게 SELECT * FROM emp WHERE ENAME = "SMITH"와 같은 내용

[{'_id': ObjectId('6232b72aac16255c494f1e42'),
  '': '0',
  'EMPNO': '7369',
  'ENAME': 'SMITH',
  'JOB': 'CLERK',
  'MGR': '7902',
  'HIREDATE': '1980-12-17',
  'SAL': '800.00',
  'DEPTNO': '20'}]

In [ ]:
## emp collection
## key 값이 EMPNO, ENAME, DEPTNO만 출력이 되도록 코드를 작성

result = db.emp.find( 
    {},                 # where 조건을 쓸때 사용하는 공간
    {"EMPNO" : 1, 
    "ENAME": 1, 
    "DEPTNO":1})        # key\의 값을 선택할 수 있는 공간
for list in result:
    print(list)

# SELECT

{'_id': ObjectId('6232b72aac16255c494f1e42'), 'EMPNO': '7369', 'ENAME': 'SMITH', 'DEPTNO': '20'}
{'_id': ObjectId('6232b72aac16255c494f1e43'), 'EMPNO': '7499', 'ENAME': 'ALLEN', 'DEPTNO': '30'}
{'_id': ObjectId('6232b72aac16255c494f1e44'), 'EMPNO': '7521', 'ENAME': 'WARD', 'DEPTNO': '30'}
{'_id': ObjectId('6232b72aac16255c494f1e45'), 'EMPNO': '7566', 'ENAME': 'JONES', 'DEPTNO': '20'}
{'_id': ObjectId('6232b72aac16255c494f1e46'), 'EMPNO': '7654', 'ENAME': 'MARTIN', 'DEPTNO': '30'}
{'_id': ObjectId('6232b72aac16255c494f1e47'), 'EMPNO': '7698', 'ENAME': 'BLAKE', 'DEPTNO': '30'}
{'_id': ObjectId('6232b72aac16255c494f1e48'), 'EMPNO': '7782', 'ENAME': 'CLARK', 'DEPTNO': '10'}
{'_id': ObjectId('6232b72aac16255c494f1e49'), 'EMPNO': '7788', 'ENAME': 'SCOTT', 'DEPTNO': '20'}
{'_id': ObjectId('6232b72aac16255c494f1e4a'), 'EMPNO': '7839', 'ENAME': 'KING', 'DEPTNO': '10'}
{'_id': ObjectId('6232b72aac16255c494f1e4b'), 'EMPNO': '7844', 'ENAME': 'TURNER', 'DEPTNO': '30'}
{'_id': ObjectId('6232b72aac16255c494f1e4c'), 'EMPNO': '7876', 'ENAME': 'ADAMS', 'DEPTNO': '20'}
{'_id': ObjectId('6232b72aac16255c494f1e4d'), 'EMPNO': '7900', 'ENAME': 'JAMES', 'DEPTNO': '30'}
{'_id': ObjectId('6232b72aac16255c494f1e4e'), 'EMPNO': '7902', 'ENAME': 'FORD', 'DEPTNO': '20'}
{'_id': ObjectId('6232b72aac16255c494f1e4f'), 'EMPNO': '7934', 'ENAME': 'MILLER', 'DEPTNO': '10'}

In [ ]:
def find(a, b = 3):
    return a + b

find("","5")

'5'

In [23]:
result = db.emp.find().sort("ENAME")

for list in result:
    pprint.pprint(list)

# SELECT * FROM emp ORDER BY ENAME

{'': '10',
 'DEPTNO': '20',
 'EMPNO': '7876',
 'ENAME': 'ADAMS',
 'HIREDATE': '1987-07-13',
 'JOB': 'CLERK',
 'MGR': '7788',
 'SAL': '1100.00',
 '_id': ObjectId('6232b72aac16255c494f1e4c')}
{'': '10',
 'DEPTNO': 20,
 'EMPNO': 7876,
 'ENAME': 'ADAMS',
 'HIREDATE': '1987-07-13',
 'JOB': 'CLERK',
 'MGR': 7788,
 'SAL': 1100.0,
 '_id': ObjectId('6232c6e989fd012ac7c4ce55')}
{'': '1',
 'COMM': '300.00',
 'DEPTNO': '30',
 'EMPNO': '7499',
 'ENAME': 'ALLEN',
 'HIREDATE': '1981-02-20',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': 2000,
 '_id': ObjectId('6232b72aac16255c494f1e43')}
{'': '1',
 'COMM': 300.0,
 'DEPTNO': 30,
 'EMPNO': 7499,
 'ENAME': 'ALLEN',
 'HIREDATE': '1981-02-20',
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 2000,
 '_id': ObjectId('6232c6e989fd012ac7c4ce4c')}
{'': '5',
 'DEPTNO': '30',
 'EMPNO': '7698',
 'ENAME': 'BLAKE',
 'HIREDATE': '1981-05-01',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2850.00',
 '_id': ObjectId('6232b72aac16255c494f1e47')}
{'': '5',
 'DEPTNO': 30,
 'EMPNO': 7698,
 'ENAME': 'BLAKE',
 'HIREDATE': '1981-05-01',
 'JOB': 'MANAGER',
 'MGR': 7839,
 'SAL': 2850.0,
 '_id': ObjectId('6232c6e989fd012ac7c4ce50')}
{'': '6',
 'DEPTNO': '10',
 'EMPNO': '7782',
 'ENAME': 'CLARK',
 'HIREDATE': '1981-06-09',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2450.00',
 '_id': ObjectId('6232b72aac16255c494f1e48')}
{'': '6',
 'DEPTNO': 10,
 'EMPNO': 7782,
 'ENAME': 'CLARK',
 'HIREDATE': '1981-06-09',
 'JOB': 'MANAGER',
 'MGR': 7839,
 'SAL': 2450.0,
 '_id': ObjectId('6232c6e989fd012ac7c4ce51')}
{'': '12',
 'DEPTNO': '20',
 'EMPNO': '7902',
 'ENAME': 'FORD',
 'HIREDATE': '1981-12-03',
 'JOB': 'ANALYST',
 'MGR': '7566',
 'SAL': '3000.00',
 '_id': ObjectId('6232b72aac16255c494f1e4e')}
{'': '12',
 'DEPTNO': 20,
 'EMPNO': 7902,
 'ENAME': 'FORD',
 'HIREDATE': '1981-12-03',
 'JOB': 'ANALYST',
 'MGR': 7566,
 'SAL': 3000.0,
 '_id': ObjectId('6232c6e989fd012ac7c4ce57')}
{'': '11',
 'DEPTNO': '30',
 'EMPNO': '7900',
 'ENAME': 'JAMES',
 'HIREDATE': '1981-12-03',
 'JOB': 'CLERK',
 'MGR': '7698',
 'SAL': '950.00',
 '_id': ObjectId('6232b72aac16255c494f1e4d')}
{'': '11',
 'DEPTNO': 30,
 'EMPNO': 7900,
 'ENAME': 'JAMES',
 'HIREDATE': '1981-12-03',
 'JOB': 'CLERK',
 'MGR': 7698,
 'SAL': 950.0,
 '_id': ObjectId('6232c6e989fd012ac7c4ce56')}
{'': '3',
 'DEPTNO': '20',
 'EMPNO': '7566',
 'ENAME': 'JONES',
 'HIREDATE': '1981-04-02',
 'JOB': 'MANAGER',
 'MGR': '7839',
 'SAL': '2975.00',
 '_id': ObjectId('6232b72aac16255c494f1e45')}
{'': '3',
 'DEPTNO': 20,
 'EMPNO': 7566,
 'ENAME': 'JONES',
 'HIREDATE': '1981-04-02',
 'JOB': 'MANAGER',
 'MGR': 7839,
 'SAL': 2975.0,
 '_id': ObjectId('6232c6e989fd012ac7c4ce4e')}
{'': '8',
 'DEPTNO': 10,
 'EMPNO': 7839,
 'ENAME': 'KING',
 'HIREDATE': '1981-11-17',
 'JOB': 'PRESIDENT',
 'SAL': 5000.0,
 '_id': ObjectId('6232c6e989fd012ac7c4ce53')}
{'': '4',
 'COMM': '1400.00',
 'DEPTNO': '30',
 'EMPNO': '7654',
 'ENAME': 'MARTIN',
 'HIREDATE': '1981-09-28',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1250.00',
 '_id': ObjectId('6232b72aac16255c494f1e46')}
{'': '4',
 'COMM': 1400.0,
 'DEPTNO': 30,
 'EMPNO': 7654,
 'ENAME': 'MARTIN',
 'HIREDATE': '1981-09-28',
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1250.0,
 '_id': ObjectId('6232c6e989fd012ac7c4ce4f')}
{'': '7',
 'DEPTNO': '20',
 'EMPNO': '7788',
 'ENAME': 'SCOTT',
 'HIREDATE': '1987-06-28',
 'JOB': 'ANALYST',
 'MGR': '7566',
 'SAL': '3000.00',
 '_id': ObjectId('6232b72aac16255c494f1e49')}
{'': '7',
 'DEPTNO': 20,
 'EMPNO': 7788,
 'ENAME': 'SCOTT',
 'HIREDATE': '1987-06-28',
 'JOB': 'ANALYST',
 'MGR': 7566,
 'SAL': 3000.0,
 '_id': ObjectId('6232c6e989fd012ac7c4ce52')}
{'': '0',
 'DEPTNO': '20',
 'EMPNO': '7369',
 'ENAME': 'SMITH',
 'HIREDATE': '1980-12-17',
 'JOB': 'CLERK',
 'MGR': '7902',
 'SAL': 880,
 '_id': ObjectId('6232b72aac16255c494f1e42')}
{'': '0',
 'DEPTNO': 20,
 'EMPNO': 7369,
 'ENAME': 'SMITH',
 'HIREDATE': '1980-12-17',
 'JOB': 'CLERK',
 'MGR': 7902,
 'SAL': 800.0,
 '_id': ObjectId('6232c6e989fd012ac7c4ce4b')}
{'': '9',
 'COMM': '0.00',
 'DEPTNO': '30',
 'EMPNO': '7844',
 'ENAME': 'TURNER',
 'HIREDATE': '1981-09-08',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1500.00',
 '_id': ObjectId('6232b72aac16255c494f1e4b')}
{'': '9',
 'COMM': 0.0,
 'DEPTNO': 30,
 'EMPNO': 7844,
 'ENAME': 'TURNER',
 'HIREDATE': '1981-09-08',
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1500.0,
 '_id': ObjectId('6232c6e989fd012ac7c4ce54')}
{'': '2',
 'COMM': '500.00',
 'DEPTNO': '30',
 'EMPNO': '7521',
 'ENAME': 'WARD',
 'HIREDATE': '1981-02-22',
 'JOB': 'SALESMAN',
 'MGR': '7698',
 'SAL': '1250.00',
 '_id': ObjectId('6232b72aac16255c494f1e44')}
{'': '2',
 'COMM': 500.0,
 'DEPTNO': 30,
 'EMPNO': 7521,
 'ENAME': 'WARD',
 'HIREDATE': '1981-02-22',
 'JOB': 'SALESMAN',
 'MGR': 7698,
 'SAL': 1250.0,
 '_id': ObjectId('6232c6e989fd012ac7c4ce4d')}

In [ ]:
# 급여가 2000보다 큰 데이터만 출력
result = db.emp.find( 
    { 
        "SAL" : { 
            "$gt": 2000
        }
    }
)
for list in result:
    print(list)

# SELECT * FROM emp WHERE SAL > 2000

{'_id': ObjectId('6232c6e989fd012ac7c4ce4e'), '': '3', 'EMPNO': 7566, 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-04-02', 'SAL': 2975.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c6e989fd012ac7c4ce50'), '': '5', 'EMPNO': 7698, 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-05-01', 'SAL': 2850.0, 'DEPTNO': 30}
{'_id': ObjectId('6232c6e989fd012ac7c4ce51'), '': '6', 'EMPNO': 7782, 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-06-09', 'SAL': 2450.0, 'DEPTNO': 10}
{'_id': ObjectId('6232c6e989fd012ac7c4ce52'), '': '7', 'EMPNO': 7788, 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1987-06-28', 'SAL': 3000.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c6e989fd012ac7c4ce53'), '': '8', 'EMPNO': 7839, 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'HIREDATE': '1981-11-17', 'SAL': 5000.0, 'DEPTNO': 10}
{'_id': ObjectId('6232c6e989fd012ac7c4ce57'), '': '12', 'EMPNO': 7902, 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1981-12-03', 'SAL': 3000.0, 'DEPTNO': 20}

In [ ]:
# 급여가 2450보다 크거나 같은 데이터만 출력
result = db.emp.find( 
    { 
        "SAL" : { 
            "$gte": 2450
        }
    }
)
for list in result:
    print(list)

# SELECT * FROM emp WHERE SAL >= 2450

{'_id': ObjectId('6232c6e989fd012ac7c4ce4e'), '': '3', 'EMPNO': 7566, 'ENAME': 'JONES', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-04-02', 'SAL': 2975.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c6e989fd012ac7c4ce50'), '': '5', 'EMPNO': 7698, 'ENAME': 'BLAKE', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-05-01', 'SAL': 2850.0, 'DEPTNO': 30}
{'_id': ObjectId('6232c6e989fd012ac7c4ce51'), '': '6', 'EMPNO': 7782, 'ENAME': 'CLARK', 'JOB': 'MANAGER', 'MGR': 7839, 'HIREDATE': '1981-06-09', 'SAL': 2450.0, 'DEPTNO': 10}
{'_id': ObjectId('6232c6e989fd012ac7c4ce52'), '': '7', 'EMPNO': 7788, 'ENAME': 'SCOTT', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1987-06-28', 'SAL': 3000.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c6e989fd012ac7c4ce53'), '': '8', 'EMPNO': 7839, 'ENAME': 'KING', 'JOB': 'PRESIDENT', 'HIREDATE': '1981-11-17', 'SAL': 5000.0, 'DEPTNO': 10}
{'_id': ObjectId('6232c6e989fd012ac7c4ce57'), '': '12', 'EMPNO': 7902, 'ENAME': 'FORD', 'JOB': 'ANALYST', 'MGR': 7566, 'HIREDATE': '1981-12-03', 'SAL': 3000.0, 'DEPTNO': 20}

In [ ]:
# 급여가 2450보다 작은 데이터만 출력
result = db.emp.find( 
    { 
        "SAL" : { 
            "$lt": 2450
        }
    }
)
for list in result:
    print(list)

# SELECT * FROM emp WHERE SAL < 2450

{'_id': ObjectId('6232c6e989fd012ac7c4ce4b'), '': '0', 'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': '1980-12-17', 'SAL': 800.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c6e989fd012ac7c4ce4c'), '': '1', 'EMPNO': 7499, 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-02-20', 'SAL': 1600.0, 'COMM': 300.0, 'DEPTNO': 30}
{'_id': ObjectId('6232c6e989fd012ac7c4ce4d'), '': '2', 'EMPNO': 7521, 'ENAME': 'WARD', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-02-22', 'SAL': 1250.0, 'COMM': 500.0, 'DEPTNO': 30}
{'_id': ObjectId('6232c6e989fd012ac7c4ce4f'), '': '4', 'EMPNO': 7654, 'ENAME': 'MARTIN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-09-28', 'SAL': 1250.0, 'COMM': 1400.0, 'DEPTNO': 30}
{'_id': ObjectId('6232c6e989fd012ac7c4ce54'), '': '9', 'EMPNO': 7844, 'ENAME': 'TURNER', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-09-08', 'SAL': 1500.0, 'COMM': 0.0, 'DEPTNO': 30}
{'_id': ObjectId('6232c6e989fd012ac7c4ce55'), '': '10', 'EMPNO': 7876, 'ENAME': 'ADAMS', 'JOB': 'CLERK', 'MGR': 7788, 'HIREDATE': '1987-07-13', 'SAL': 1100.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c6e989fd012ac7c4ce56'), '': '11', 'EMPNO': 7900, 'ENAME': 'JAMES', 'JOB': 'CLERK', 'MGR': 7698, 'HIREDATE': '1981-12-03', 'SAL': 950.0, 'DEPTNO': 30}
{'_id': ObjectId('6232c6e989fd012ac7c4ce58'), '': '13', 'EMPNO': 7934, 'ENAME': 'MILLER', 'JOB': 'CLERK', 'MGR': 7782, 'HIREDATE': '1982-01-23', 'SAL': 1300.0, 'DEPTNO': 10}

In [ ]:
# SELECT * FROM emp WHERE ENAME = SMITH OR ENAME = ALLEN
result = db.emp.find( 
    { 
        "$or" : [ 
            { 
                "ENAME" : "SMITH"
            }, 
            { 
                "ENAME" : "ALLEN"
            }
        ]
    }
)
for list in result:
    print(list)

# AND를 쓰고 싶으면 {} 안에 저거 둘 다 ,로 붙여서 넣으면 됨

{'_id': ObjectId('6232b72aac16255c494f1e42'), '': '0', 'EMPNO': '7369', 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': '7902', 'HIREDATE': '1980-12-17', 'SAL': '800.00', 'DEPTNO': '20'}
{'_id': ObjectId('6232b72aac16255c494f1e43'), '': '1', 'EMPNO': '7499', 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': '7698', 'HIREDATE': '1981-02-20', 'SAL': '1600.00', 'COMM': '300.00', 'DEPTNO': '30'}
{'_id': ObjectId('6232c6e989fd012ac7c4ce4b'), '': '0', 'EMPNO': 7369, 'ENAME': 'SMITH', 'JOB': 'CLERK', 'MGR': 7902, 'HIREDATE': '1980-12-17', 'SAL': 800.0, 'DEPTNO': 20}
{'_id': ObjectId('6232c6e989fd012ac7c4ce4c'), '': '1', 'EMPNO': 7499, 'ENAME': 'ALLEN', 'JOB': 'SALESMAN', 'MGR': 7698, 'HIREDATE': '1981-02-20', 'SAL': 1600.0, 'COMM': 300.0, 'DEPTNO': 30}

In [ ]:
# SELECT * FROM emp WHERE SAL >= 2000 AND SAL < 4000
result = db.emp.find( 
    { 
        "SAL" : { 
            "$gte": 2000, "$lt": 4000}
    }
)
pd.DataFrame(result)

,_id,,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232c6e989fd012ac7c4ce4e,3,7566,JONES,MANAGER,7839,1981-04-02,2975.0,20
1,6232c6e989fd012ac7c4ce50,5,7698,BLAKE,MANAGER,7839,1981-05-01,2850.0,30
2,6232c6e989fd012ac7c4ce51,6,7782,CLARK,MANAGER,7839,1981-06-09,2450.0,10
3,6232c6e989fd012ac7c4ce52,7,7788,SCOTT,ANALYST,7566,1987-06-28,3000.0,20
4,6232c6e989fd012ac7c4ce57,12,7902,FORD,ANALYST,7566,1981-12-03,3000.0,20

In [ ]:
# SELECT * FROM emp WHERE ENAME LIKE %S%  %위치로 S로 시작하냐 끝나냐 포함하냐
result = db.emp.find( 
    { 
        "ENAME" : {
            "$regex" : "^S"
        }
    }
)
pd.DataFrame(result)

,_id,,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232b72aac16255c494f1e42,0,7369,SMITH,CLERK,7902,1980-12-17,800.00,20
1,6232b72aac16255c494f1e49,7,7788,SCOTT,ANALYST,7566,1987-06-28,3000.00,20
2,6232c6e989fd012ac7c4ce4b,0,7369,SMITH,CLERK,7902,1980-12-17,800.0,20
3,6232c6e989fd012ac7c4ce52,7,7788,SCOTT,ANALYST,7566,1987-06-28,3000.0,20

In [17]:
# SELECT ENAME, JOB, SAL, DEPTNO FROM emp 
# WHERE SAL > 1500 AND 
# SAL <= 3000 AND 
# JOB = CLERK 
# ORDER BY ENAME
result = db.emp.find( 
    { 
        "SAL" :{ 
            "$gt" : 1250, 
            "$lte" : 3000
        }, 
        "JOB" : "SALESMAN"
    }, 
    { 
        "ENAME" : 1, 
        "JOB" : 1, 
        "SAL" : 1, 
        "DEPTNO" : 1, 
        "_id" : 0
    }
).sort("ENAME",1)

pd.DataFrame(result)

    ENAME       JOB     SAL  DEPTNO
0   ALLEN  SALESMAN  1600.0      30
1  TURNER  SALESMAN  1500.0      30

In [18]:
result = db.emp.find()
pd.DataFrame(result)

,_id,,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO,COMM
0,6232b72aac16255c494f1e42,0,7369,SMITH,CLERK,7902,1980-12-17,800.00,20,NaN
1,6232b72aac16255c494f1e43,1,7499,ALLEN,SALESMAN,7698,1981-02-20,1600.00,30,300.00
2,6232b72aac16255c494f1e44,2,7521,WARD,SALESMAN,7698,1981-02-22,1250.00,30,500.00
3,6232b72aac16255c494f1e45,3,7566,JONES,MANAGER,7839,1981-04-02,2975.00,20,NaN
4,6232b72aac16255c494f1e46,4,7654,MARTIN,SALESMAN,7698,1981-09-28,1250.00,30,1400.00
5,6232b72aac16255c494f1e47,5,7698,BLAKE,MANAGER,7839,1981-05-01,2850.00,30,NaN
6,6232b72aac16255c494f1e48,6,7782,CLARK,MANAGER,7839,1981-06-09,2450.00,10,NaN
7,6232b72aac16255c494f1e49,7,7788,SCOTT,ANALYST,7566,1987-06-28,3000.00,20,NaN
8,6232b72aac16255c494f1e4a,8,7839,KING,PRESIDENT,NaN,1981-11-17,5000.00,10,NaN
9,6232b72aac16255c494f1e4b,9,7844,TURNER,SALESMAN,7698,1981-09-08,1500.00,30,0.00
10,6232b72aac16255c494f1e4c,10,7876,ADAMS,CLERK,7788,1987-07-13,1100.00,20,NaN
11,6232b72aac16255c494f1e4d,11,7900,JAMES,CLERK,7698,1981-12-03,950.00,30,NaN
12,6232b72aac16255c494f1e4e,12,7902,FORD,ANALYST,7566,1981-12-03,3000.00,20,NaN
13,6232b72aac16255c494f1e4f,13,7934,MILLER,CLERK,7782,1982-01-23,1300.00,10,NaN
14,6232c6e989fd012ac7c4ce4b,0,7369,SMITH,CLERK,7902,1980-12-17,800.0,20,NaN
15,6232c6e989fd012ac7c4ce4c,1,7499,ALLEN,SALESMAN,7698,1981-02-20,1600.0,30,300.0
16,6232c6e989fd012ac7c4ce4d,2,7521,WARD,SALESMAN,7698,1981-02-22,1250.0,30,500.0
17,6232c6e989fd012ac7c4ce4e,3,7566,JONES,MANAGER,7839,1981-04-02,2975.0,20,NaN
18,6232c6e989fd012ac7c4ce4f,4,7654,MARTIN,SALESMAN,7698,1981-09-28,1250.0,30,1400.0
19,6232c6e989fd012ac7c4ce50,5,7698,BLAKE,MANAGER,7839,1981-05-01,2850.0,30,NaN
20,6232c6e989fd012ac7c4ce51,6,7782,CLARK,MANAGER,7839,1981-06-09,2450.0,10,NaN
21,6232c6e989fd012ac7c4ce52,7,7788,SCOTT,ANALYST,7566,1987-06-28,3000.0,20,NaN
22,6232c6e989fd012ac7c4ce53,8,7839,KING,PRESIDENT,NaN,1981-11-17,5000.0,10,NaN
23,6232c6e989fd012ac7c4ce54,9,7844,TURNER,SALESMAN,7698,1981-09-08,1500.0,30,0.0
24,6232c6e989fd012ac7c4ce55,10,7876,ADAMS,CLERK,7788,1987-07-13,1100.0,20,NaN
25,6232c6e989fd012ac7c4ce56,11,7900,JAMES,CLERK,7698,1981-12-03,950.0,30,NaN
26,6232c6e989fd012ac7c4ce57,12,7902,FORD,ANALYST,7566,1981-12-03,3000.0,20,NaN
27,6232c6e989fd012ac7c4ce58,13,7934,MILLER,CLERK,7782,1982-01-23,1300.0,10,NaN

In [19]:
db.emp.update_one( 
    { 
        "ENAME":"SMITH"
    }, 
    { 
        "$set":{ 
            "SAL":880
        }
    }
)

In [20]:
result = db.emp.find( 
    {"ENAME":"SMITH"}
)
pd.DataFrame(result)

,_id,,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,DEPTNO
0,6232b72aac16255c494f1e42,0,7369,SMITH,CLERK,7902,1980-12-17,880.0,20
1,6232c6e989fd012ac7c4ce4b,0,7369,SMITH,CLERK,7902,1980-12-17,800.0,20

In [21]:
db.emp.update_many( 
    {"ENAME":"ALLEN"}, 
    {"$set":{"SAL":2000}}
)

In [22]:
result = db.emp.find( 
    {"ENAME":"ALLEN"}
)
pd.DataFrame(result)

,_id,,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO
0,6232b72aac16255c494f1e43,1,7499,ALLEN,SALESMAN,7698,1981-02-20,2000,300.00,30
1,6232c6e989fd012ac7c4ce4c,1,7499,ALLEN,SALESMAN,7698,1981-02-20,2000,300.0,30

In [23]:
db.emp.delete_one( 
    { 
        "JOB":"PRESIDENT"
    }
)

In [24]:
result = db.emp.find( 
    {"JOB":"PRESIDENT"}
)
pd.DataFrame(result)

,_id,,EMPNO,ENAME,JOB,HIREDATE,SAL,DEPTNO
0,6232c6e989fd012ac7c4ce53,8,7839,KING,PRESIDENT,1981-11-17,5000.0,10

In [25]:
db.emp.delete_many( 
    {"ENAME":"MILLER"}
)

In [26]:
result = db.emp.find( 
    {"ENAME":"MILLER"}
)
pd.DataFrame(result)

Empty DataFrame
Columns: []
Index: []